// WWW = URL + HTTP + HTML 

// HTTP
// 超文本传输协议

// 什么是IP(internet Protocol)
// 主要约定了两件事
// 1.如何定位一台设备
// 2.如何封装数据报文 以跟其他设备交流

// 只要你在互联网中 你就有至少一个独立的IP

// IP分为内网和外网
// 内网和外网.png

// 如何获取外网IP
// 你从电信租用带宽
// 你买了一个路由器 然后用电脑和手机分别连接路由器广播出来的无线WIFI
// 只要路由器连上电信的服务器 那么路由器就会有一个外网IP 
// 比如 14.17.32.211 就是一个外网IP 这就是你在互联网中的地址 www.ip138.com
// 但是如果你重启路由器 那么你很有可能被重新分配一个外网IP
// 也就是说 你的路由器没有固定的外网IP

// 内网IP
// 路由器会在你家里创建一个内网 内网中的设备使用内网IP
// 一般来说这个IP的格式都是 192.168.xxx.xxx
// 一般路由会给自己分配一个好记的内网IP 如 192.168.1.1
// 然后路由会给每一个内网中的设备分配一个不同的内网IP
// 如电脑是 192.168.1.2 手机是 192.168.1.3 以此类推

// 路由器的功能
// 现在路由器有两个IP 一个内网IP和一个外网IP
// 内网中的设备可以互相访问 但是不能直接访问外网
// 内网设备想要访问外网 就必须经过路由器中转
// 外网中的设备可以互相访问 但是无法访问你的内网
// 外网设备想要把内容送到内网 也必须通过路由器
// 也就是说内网和外网就像两个隔绝的空间 无法互通 唯一的联通点就是路由器
// 所以路由器有时候也被叫做网关











